# Pandas

In [6]:
import pandas as pd

## Series

In [ ]:

data =[10,20,30,40,50]
s = pd.Series(data)
print(s)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [11]:
array = ([10,20,30,40,50])
a = pd.Series(array)
print(a)
print(a.index)
print(a.values)

0    10
1    20
2    30
3    40
4    50
dtype: int64
RangeIndex(start=0, stop=5, step=1)
[10 20 30 40 50]

In [12]:
# using lebels

data = pd.Series([1,"nishan",3.5,"school"],index=["ram","a","b","c"])
print (data)

ram         1
a      nishan
b         3.5
c      school
dtype: object

In [ ]:
# creating using dict

score ={"jane":90,"bill":80,"elon":85,"tom":75,"tim":95,"gp":None}
names= pd.Series(score)
print(names)

names["jane"]

jane    90.0
bill    80.0
elon    85.0
tom     75.0
tim     95.0
gp       NaN
dtype: float64

np.float64(90.0)

## Boolean indexing

In [16]:
names[names>=85]

jane    90.0
elon    85.0
tim     95.0
dtype: float64

## Modifing values

In [ ]:
names[names <= 80]=83
names

jane    90.0
bill    83.0
elon    85.0
tom     83.0
tim     95.0
gp       NaN
dtype: float64

## checking membership

In [ ]:
"tom" in names

"can" in names

False

In [22]:
if "nishan" in names:
    print("say hello")
else:
    print("not in the list")

not in the list

## operation

In [46]:
names/10

jane    9.0
bill    8.3
elon    8.5
tom     8.3
tim     9.5
dtype: float64

In [24]:
names ** 2

jane    8100.0
bill    6889.0
elon    7225.0
tom     6889.0
tim     9025.0
gp         NaN
dtype: float64

In [25]:
names + 5

jane     95.0
bill     88.0
elon     90.0
tom      88.0
tim     100.0
gp        NaN
dtype: float64

## handling missing data

In [ ]:
data = pd.Series([1,2,None,4,5])
data.mean(skipna=True)

names.isnull()

jane    False
bill    False
elon    False
tom     False
tim     False
gp       True
dtype: bool

In [33]:
names.isna()

jane    False
bill    False
elon    False
tom     False
tim     False
gp       True
dtype: bool

In [34]:
names.isna().any()

np.True_

In [35]:
names.isnull().any()

np.True_

In [38]:
names.dropna()

jane    90.0
bill    83.0
elon    85.0
tom     83.0
tim     95.0
dtype: float64

In [39]:
names

jane    90.0
bill    83.0
elon    85.0
tom     83.0
tim     95.0
dtype: float64

In [37]:
names.dropna(inplace = True)
names

jane    90.0
bill    83.0
elon    85.0
tom     83.0
tim     95.0
dtype: float64

In [ ]:
names.fillna(10,inplace = True)

jane    90.0
bill    83.0
elon    85.0
tom     83.0
tim     95.0
dtype: float64

In [42]:
names

jane    90.0
bill    83.0
elon    85.0
tom     83.0
tim     95.0
dtype: float64

## Data Frame

In [48]:
data ={
    "name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],
    "score":[90,80,85,75,95,60,65],
    "sport":["wersling","football","skiing","swimming","tennis","kerate","surfing"],
    "gender":["M","M","M","F","M","M","M"]
}
df =pd.DataFrame(data)
df

      name  score     sport gender
0     Bill     90  wersling      M
1      Tom     80  football      M
2      Tim     85    skiing      M
3     John     75  swimming      F
4     Alex     95    tennis      M
5  Vanessa     60    kerate      M
6     Kate     65   surfing      M